import echarts from 'echarts';

const colorList = ['#2373FF', '#FE774B', '#1DCEC3', '#F16E84', '#FDD352', '#7BABFF', '#FFAE93', '#77E1DB', '#F6A8B5', '#FEE597', '#BDD5FF', '#FFD7C9', '#BBF1ED', '#FBD4DA', '#FEF1CB', '#FF9F7F'];
const ljEData = {
	colorList,
	ljBox1: {
		title: 'GMV近30天变化趋势',
		legName: ['元气森林', '和其正', '加多宝', '王老吉'],
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		value: [252, 297, 297, 268, 260, 260]
	},
	ljBox2: {
		legName: ['小程序日活', 'Web端日活', 'APP端日活'],
		name: ['2021/2/22', '2021/2/23', '2021/2/24', '2021/2/25', '2021/2/26', '2021/2/27', '2021/2/28',],
		value: [
			{
				name: '小程序日活',
				type: 'line',
				data: [1522, 1373, 1453, 1851, 1914, 1904, 1855]
			},
			{
				name: 'Web端日活',
				type: 'line',
				data: [1287, 1524, 1585, 1711, 1380, 1368, 1421]
			},
			{
				name: 'APP端日活',
				type: 'line',
				data: [1225, 1321, 1113, 1350, 1177, 1223, 1312]
			},
		]
	},
	ljBox3: {
		name: ['1天', '2天', '3天', '4天', '5天', '6天', '7天',],
		value: [
			{type: 'bar', stack: '总量', barWidth: '10', data: [741, 632, 501, 232, 122, 73, 32]},
		]
	},
	ljBox4: {
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		value: [277, 302, 280, 334, 249, 258]
	},
	ljBox5: {
		legName: ['有认知', '无认知'],
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		value: [
			{
				name: '有认知',
				type: 'line',
				data: [877, 902, 880, 834, 849, 858]
			},
			{
				name: '无认知',
				type: 'line',
				data: [92, 96, 95, 94, 97, 94]
			},
		]
	},
	ljBox6: {
		legName: ['浏览页面', '加购物车', '付费'],
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		value: [
			{
				name: '浏览页面',
				type: 'line',
				data: [418, 463, 406, 536, 471, 536]
			},
			{
				name: '加购物车',
				type: 'line',
				data: [238, 194, 227, 210, 307, 253]
			},
			{
				name: '付费',
				type: 'line',
				data: [135, 122, 137, 158, 138, 141]
			},
		]
	},
	ljBox7: {
		legName: ['非会员', '普通会员', 'VIP会员'],
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		value: [
			{
				name: '非会员',
				type: 'line',
				data: [133, 164, 118, 130, 130, 136]
			},
			{
				name: '普通会员',
				type: 'line',
				data: [244, 273, 287, 230, 350, 307]
			},
			{
				name: 'VIP会员',
				type: 'line',
				data: [35, 52, 27, 58, 38, 41]
			},
		]
	},
	ljBox8: {
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		legName: ['新用户', '连续活跃用户', '回流用户', '沉默用户', '流失用户'],
		value: [
			{
				name: '新用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [380, 382, 373, 388, 392, 379]
			},
			{
				name: '连续活跃用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [1790, 1822, 1769, 1791, 1726, 1744]
			},
			{
				name: '回流用户',
				type: 'bar',
				barWidth: '10',
				stack: '总量',
				data: [2643, 2632, 2612, 2624, 2643, 2611]
			},
			{
				name: '沉默用户',
				type: 'bar',
				barWidth: '10',
				stack: '总量',
				data: [3567, 3416, 3385, 3713, 3808, 3607]
			},
			{
				name: '流失用户',
				type: 'bar',
				barWidth: '10',
				stack: '总量',
				data: [1764, 1814, 1518, 1575, 1779, 1701]
			},
		]
	},
	ljBox9: {
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		value: [164, 371, 379, 432, 429, 557]
	},
	ljBox10: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/1', '2021/3/2'],
		value: [529, 499, 418, 391, 322, 244]
	},
	ljBox11: {
		name: ['1-25当周', '2-1当周', '2-8当周', '2-15当周', '2-22当周', '3-1当周'],
		value: [150, 220, 335, 464, 301, 244]
	},
	ljBox12: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		value: [263, 220, 266, 211, 278, 244]
	},
	ljBox13: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		legName: ['新用户', '老用户'],
		value: [
			{
				name: '新用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [100, 73, 66, 98, 131, 190]
			},
			{
				name: '老用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [800, 900, 973, 1039, 1137, 1268]
			},
		]
	},
	ljBox14: {
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		legName: ['活跃新用户', '活跃老用户'],
		value: [
			{
				name: '活跃新用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [137, 122, 119, 136, 132, 123]
			},
			{
				name: '活跃老用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [1590, 1522, 1469, 1491, 1526, 1544]
			},
		]
	},
	ljBox15: {
		name: ['1-25当周', '2-1当周', '2-8当周', '2-15当周', '2-22当周', '3-1当周'],
		value: [6150, 5620, 6335, 5764, 6301, 6244]
	},
	ljBox16: {
		name: ['2021/2/1', '2021/2/6', '2021/2/11', '2021/2/16', '2021/2/21', '2021/2/26'],
		legName: ['周新增用户', '老用户'],
		value: [
			{
				name: '周新增用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [100, 110, 130, 140, 140, 150]
			},
			{
				name: '老用户',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [1200, 1300, 1410, 1540, 1680, 1820]
			},
		]
	},
	ljBox17: {
		legName: ['首日登陆用户', '第二日登陆用户', '第三日登陆用户'],
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3', '2021/3/4'],
		value: [
			{
				name: '首日登陆用户',
				type: 'line',
				data: [995, 966, 928, 684, 556, 479, 431]
			},
			{
				name: '第二日登陆用户',
				type: 'line',
				data: [null, 880, 708, 584, 465, 412, 369]
			},
			{
				name: '第三日登陆用户',
				type: 'line',
				data: [null, null, 866, 541, 403, 344, 303]
			},
		]
	},
	ljBox18: {
		legName: ['首日登陆用户流失', '第二日登陆用户流失', '第三日登陆用户流失'],
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3', '2021/3/4'],
		value: [
			{
				name: '首日登陆用户流失',
				type: 'line',
				data: [132, 127, 93, 67, 50, 32, 21]
			},
			{
				name: '第二日登陆用户流失',
				type: 'line',
				data: [null, 165, 136, 111, 32, 28, 14]
			},
			{
				name: '第三日登陆用户流失',
				type: 'line',
				data: [null, null, 164, 180, 93, 74, 56]
			},
		]
	},
	ljBox19: {
		legName: ['首日新用户', '第二日新用户', '第三日新用户'],
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3', '2021/3/4'],
		value: [
			{
				name: '首日新用户',
				type: 'line',
				data: [200, 174, 173, 145, 139, 137, 92]
			},
			{
				name: '第二日新用户',
				type: 'line',
				data: [null, 213, 189, 163, 158, 148, 124]
			},
			{
				name: '第三日新用户',
				type: 'line',
				data: [null, null, 194, 180, 173, 164, 156]
			},
		]
	},
	ljBox20: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		value: [329, 319, 338, 311, 322, 324]
	},
	ljBox21: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		value: [0.7, 0.9, 1.4, 1.1, 1.3, 0.8]
	},
	ljBox22: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		value: [0.7, 0.9, 1.4, 1.1, 1.3, 0.8]
	},
	ljBox23: {
		legName: ['IOS', 'Android', 'Windows'],
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		value: [
			{
				name: 'IOS',
				type: 'line',
				data: [3.2, 2.8, 3.1, 2.9, 2.8, 3.1]
			},
			{
				name: 'Android',
				type: 'line',
				data: [1.9, 1.6, 2.4, 2.1, 2.3, 1.9]
			},
			{
				name: 'Windows',
				type: 'line',
				data: [1.3, 0.8, 0.9, 1.2, 1.1, 1.3]
			},
		]
	},
	ljBox24: {
		legName: ['IOS', 'Android', 'Windows'],
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		value: [
			{
				name: 'IOS',
				type: 'line',
				data: [92, 98, 89, 97, 95, 92]
			},
			{
				name: 'Android',
				type: 'line',
				data: [104, 102, 109, 92, 92, 107]
			},
			{
				name: 'Windows',
				type: 'line',
				data: [93, 89, 95, 99, 88, 92]
			},
		]
	},
	ljBox25: {
		name: ['7:00', '9:00', '11:00', '13:00', '15:00', '17:00', '19:00', '21:00', '23:00'],
		legName: ['微信', '腾讯微博', '今日头条'],
		value: [
			{
				name: '微信',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [67, 65, 77, 78, 78, 126, 142, 159, 171]
			},
			{
				name: '腾讯微博',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [56, 92, 84, 97, 86, 105, 83, 75, 79]
			},
			{
				name: '今日头条',
				type: 'bar',
				barWidth: '10',
				stack: '总量',
				data: [78, 93, 101, 98, 87, 83, 64, 67, 56]
			},
		]
	},
	ljBox26: {
		name: ['1-25当周', '2-1当周', '2-8当周', '2-15当周', '2-22当周', '3-1当周'],
		legName: ['腾讯微博', '今日头条', '小红书'],
		value: [
			{
				name: '腾讯微博',
				type: 'line',
				stack: '总量',
				data: [364, 371, 379, 432, 429, 557]
			},
			{
				name: '今日头条',
				type: 'line',
				stack: '总量',
				data: [280, 262, 279, 298, 278, 299]
			},
			{
				name: '小红书',
				type: 'line',
				stack: '总量',
				data: [195, 199, 198, 201, 190, 211]
			},
		]
	},
	ljBox27: {
		name: ['1-25当周', '2-1当周', '2-8当周', '2-15当周', '2-22当周', '3-1当周'],
		legName: ['腾讯微博', '今日头条', '小红书'],
		value: [
			{
				name: '腾讯微博',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [1364, 1371, 1379, 1432, 1429, 1557]
			},
			{
				name: '今日头条',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [1280, 1262, 1279, 1298, 1278, 1299]
			},
			{
				name: '小红书',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [1195, 1199, 1198, 1201, 1190, 1211]
			},
		]
	},
	ljBox28: {
		name: ['抖音', '快手', '小红书', '今日头条', '腾讯微博', '新浪微博', '微信朋友圈'],
		value: [427, 686, 683, 575, 613, 869, 1123]
	},
	ljBox29: {
		name: ['2021/2/26', '2021/2/27', '2021/2/28', '2021/3/1', '2021/3/2', '2021/3/3'],
		legName: ['腾讯微博', '今日头条', '小红书'],
		value: [
			{
				name: '腾讯微博',
				type: 'line',
				stack: '总量',
				data: [96, 92, 99, 87, 94, 99]
			},
			{
				name: '今日头条',
				type: 'line',
				stack: '总量',
				data: [101, 91, 89, 93, 99, 91]
			},
			{
				name: '小红书',
				type: 'line',
				stack: '总量',
				data: [86, 84, 82, 80, 85, 88]
			},
		]
	},
	ljBox30: {
		name: ['注册', '提交', '关注', '联系客服', '收藏', '加入购物车', '搜索', '签到', '分享', '点赞'],
		value: [427, 686, 683, 575, 613, 869, 1123, 875, 865, 899]
	},
	ljBox31: {
		name: ['2021/3/1', '2021/3/2', '2021/3/3', '2021/3/4', '2021/3/5', '2021/3/6', '2021/3/7'],
		legName: ['小程序日活', 'Web端日活', 'APP端日活'],
		value: [
			{
				name: '小程序日活',
				type: 'line',
				stack: '总量',
				data: [1588, 1373, 1453, 1751, 1814, 1904, 1955]
			},
			{
				name: 'Web端日活',
				type: 'line',
				stack: '总量',
				data: [1387, 1524, 1685, 1711, 1580, 1668, 1521]
			},
			{
				name: 'APP端日活',
				type: 'line',
				stack: '总量',
				data: [1325, 1421, 1413, 1350, 1377, 1423, 1312]
			},
		]
	},
	ljBox32: {
		name: ['健康', '一般', '危险'],
		value: [427, 686, 683]
	},
	ljBox33: {
		name: ['实施交付', '价值服务', '续约续费', '增购推进', '流失复盘', '风险预警'],
		value: [427, 686, 683, 209, 557, 190]
	},
	ljBox34: {
		name: ['2020/8/1', '2020/9/1', '2020/10/1', '2020/11/1', '2020/12/1', '2021/1/1', '2021/2/1'],
		value: [390, 483, 430, 530, 607, 659, 669],
	},
	ljBox35: {
		name: ['2020-08', '2020-09', '2020-10', '2020-11', '2020-12', '2021-01', '2021-02'],
		legName: ['当月新签', '当月续费', '当月增购', '当月存续'],
		value: [
			{
				name: '当月新签',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [12, 11, 14, 15, 13, 12, 11]
			},
			{
				name: '当月续费',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [311, 352, 364, 333, 374, 321, 368]
			},
			{
				name: '当月增购',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [112, 123, 103, 114, 108, 105, 113]
			},
			{
				name: '当月存续',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [595, 568, 586, 589, 598, 575, 589]
			},
		]
	},
	ljBox36: {
		name: ['2020-09', '2020-10', '2020-11', '2020-12', '2021-01', '2021-02', '2021-03', '2021-04', '2021-05', '2021-06', '2021-07', '2021-08', '2021-09'],
		legName: ['当月新签', '当月流失'],
		value: [
			{
				name: '当月新签',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [15.03, 6.33, 3.78, 25.44, 7.37, 6.95, 11.17, 0.58, 0, 0, 0, 0, 0].map(e => ({
					value: e,
					clientele: Math.ceil(Math.random() * 100),
					money: Math.ceil(Math.random() * 100),
					increase: Math.ceil(Math.random() * 500)
				}))
			},
			{
				name: '当月流失',
				type: 'bar',
				stack: '总量',
				barWidth: '10',
				data: [-2.17, -6.25, -4.35, -27.27, -17.86, -13.5, -12.82, -7.81, -4.25, -7.39, -36.88, -10.93, -11.22].map(e => ({
					value: e,
					clientele: Math.ceil(Math.random() * 100),
					money: Math.ceil(Math.random() * 100),
					increase: Math.ceil(Math.random() * 500)
				}))
			},
		]
	},
	ljBox37: {
		legName: ['去年', '今年'],
		name: ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],
		value: [
			{
				name: '今年',
				type: 'line',
				smooth: true,
				areaStyle: {
					normal: {
						color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
							offset: 0,
							color: 'rgba(35, 155, 255, 0.4)',
						}, {
							offset: 1,
							color: '#fff'
						}])
					},
				},
				data: [890000, 550000, 650000]
			},
			{
				name: '去年',
				type: 'line',
				smooth: true,
				areaStyle: {
					normal: {
						color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
							{
								offset: 0,
								color: 'rgba(254, 119, 75, 0.4)',
							},
							// {
							// 	offset: 0.1,
							// 	color: 'rgba(254, 119, 75, 0.4)',
							// },
							{
								offset: 1,
								color: '#fff'
							}
						])
					},
				},
				data: [800000, 1200000, 750000, 450000, 760000, 900000, 810000, 960000, 790000, 590000, 630000, 780000, 430000]
			},

		]
	},
	ljBox38: {
    name: ['抖音', '小红书', '维度'],
    value: [50, 43, 25],
  },
	ljBox39: {
    name: ['小红书','抖音', '维度'],
    value: [50, 43, 25],
  },
	ljBox40: {
    name: ['抖音', '小红书', '维度'],
    value: [50, 43, 25],
  },

}
export default ljEData;
